brew "age"
brew "gh"
brew "git"
brew "ollama"
cask "brave-browser"
cask "discord"
cask "docker-desktop"
cask "dropbox"
cask "gitkraken-cli"
cask "goland"
cask "google-chrome"
cask "gstreamer-runtime"
cask "intellij-idea"
cask "messenger"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "ngrok"
cask "pgadmin4"
cask "postman"
cask "signal"
cask "slack"
cask "visual-studio-code"
cask "warp"
cask "webstorm"
cask "whatsapp"
cask "wine-stable"
cask "zoom"
vscode "codebiscuits.assorted-biscuits"
vscode "codebiscuits.css-biscuits"
vscode "codebiscuits.html-biscuits"
vscode "codebiscuits.js-ts-biscuits"
vscode "docker.docker"
vscode "editorconfig.editorconfig"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "ms-azuretools.vscode-containers"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-playwright.playwright"
vscode "ms-vscode-remote.remote-containers"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "openai.chatgpt"
vscode "tal7aouy.icons"
vscode "tomoki1207.pdf"
vscode "vscode-icons-team.vscode-icons"
